app/controllers/books_controller.rb

INSERT INTO "books" ("title", "number_of_pages", "created_at", "updated_at", "detail") VALUES (?, ?, ?, ?, ?)  [["title", "Harry Potter"], ["number_of_pages", 200], ["created_at", "2023-02-02 08:21:15.693713"], ["updated_at", "2023-02-02 08:21:15.693713"], ["detail", "harry potter and magic stone"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2023-01-14 05:57:46.867859"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)